# customer-processor - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `failure`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.database_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.kafka_topic_credential.upstash_kafka_credential.default: Refreshing state... [id=upstash-kafka-credential-52dd14f5-10de-4100-b4e6-a41a1becc25d]
module.common_resources.module.aws_lambda.data.archive_file.default: Reading...
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.kafka_topic_credential_producer.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Reading...
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.default: Reading...
module.common_resources.module.kafka_topic_credential_consumer.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.aws_secretsmanager_secret.kafka_topic_credential_identity_v1_event: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:064003852748:secret:customer_processor_kafka_identity_v1_event-Zzi8ff]
module.common_resources.module.aws_lambda.data.aws_iam_policy_document.default: Read complete after 0s [id=3693445097]
module.common_resources.module.kafka_topic_credential_consumer.data.aws_ssm_parameter.cluster_id: Read complete after 1s [id=upstash_kafka_cluster_id]
module.common_resources.module.kafka_topic_credential_producer.data.aws_ssm_parameter.cluster_id: Read complete after 1s [id=upstash_kafka_cluster_id]
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Read complete after 1s [id=cockroachdb_serverless_cluster_id]
module.common_resources.module.database_user.cockroach_sql_user.default: Refreshing state... [id=7b5d6c4f-8a7c-4fc6-800e-a2fe8feab939:customer_processor]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Read complete after 1s [id=upstash_kafka_cluster_id]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Reading...
module.common_resources.aws_secretsmanager_secret_version.my_secret_version: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:064003852748:secret:customer_processor_kafka_identity_v1_event-Zzi8ff|3490CCDA-BA8E-4741-8AE4-132E817111B7]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Read complete after 0s [id=upstash-cluster-3aaef659-0f9f-4ab3-8c97-1bb7e0ee9ec9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.common_resources.aws_secretsmanager_secret_version.my_secret_version must be replaced
-/+ resource "aws_secretsmanager_secret_version" "my_secret_version" {
      ~ arn            = "arn:aws:secretsmanager:us-east-1:064003852748:secret:customer_processor_kafka_identity_v1_event-Zzi8ff" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:us-east-1:064003852748:secret:customer_processor_kafka_identity_v1_event-Zzi8ff|3490CCDA-BA8E-4741-8AE4-132E817111B7" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "3490CCDA-BA8E-4741-8AE4-132E817111B7" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.aws_lambda.aws_cloudwatch_log_group.default will be created
  + resource "aws_cloudwatch_log_group" "default" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/customer_processor_identity_v1_event"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "domain"        = "customer"
          + "environment"   = "production"
          + "resource"      = "customer-processor"
          + "resource_type" = "lambda"
        }
      + tags_all          = {
          + "domain"        = "customer"
          + "environment"   = "production"
          + "resource"      = "customer-processor"
          + "resource_type" = "lambda"
        }
    }

  # module.common_resources.module.aws_lambda.aws_iam_role.default will be created
  + resource "aws_iam_role" "default" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda-execution-customer_processor_identity_v1_event"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "domain"        = "customer"
          + "environment"   = "production"
          + "resource"      = "customer-processor"
          + "resource_type" = "lambda"
        }
      + tags_all              = {
          + "domain"        = "customer"
          + "environment"   = "production"
          + "resource"      = "customer-processor"
          + "resource_type" = "lambda"
        }
      + unique_id             = (known after apply)
    }

  # module.common_resources.module.aws_lambda.aws_iam_role_policy_attachment.default will be created
  + resource "aws_iam_role_policy_attachment" "default" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "lambda-execution-customer_processor_identity_v1_event"
    }

  # module.common_resources.module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "customer"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "customer_processor"
    }

  # module.common_resources.module.database_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "7b5d6c4f-8a7c-4fc6-800e-a2fe8feab939:customer_processor"
        name       = "customer_processor"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "6f836b22-91cd-4d2f-a514-ac563bef33ac" -> "de777b26-c50d-40b2-992f-2eff6880dae4"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

  # module.common_resources.module.kafka_topic_credential.upstash_kafka_credential.default will be destroyed
  # (because upstash_kafka_credential.default is not in configuration)
  - resource "upstash_kafka_credential" "default" {
      - cluster_id      = (sensitive value) -> null
      - creation_time   = 1684226589 -> null
      - credential_id   = "52dd14f5-10de-4100-b4e6-a41a1becc25d" -> null
      - credential_name = "customer_processor" -> null
      - id              = "upstash-kafka-credential-52dd14f5-10de-4100-b4e6-a41a1becc25d" -> null
      - password        = (sensitive value) -> null
      - permissions     = "CONSUME" -> null
      - state           = "active" -> null
      - topic           = "customer.v1.event" -> null
      - username        = "ZmFzdC1hbnRlYXRlci02MDE2JE-nE_TYW96CJFVu_E_xRF6Rg62-vJ72PijDfrY" -> null
    }

  # module.common_resources.module.kafka_topic_credential_consumer.upstash_kafka_credential.default will be created
  + resource "upstash_kafka_credential" "default" {
      + cluster_id      = (sensitive value)
      + creation_time   = (known after apply)
      + credential_id   = (known after apply)
      + credential_name = "customer_processor_consumer"
      + id              = (known after apply)
      + password        = (sensitive value)
      + permissions     = "CONSUME"
      + state           = (known after apply)
      + topic           = "identity.v1.event"
      + username        = (known after apply)
    }

  # module.common_resources.module.kafka_topic_credential_producer.upstash_kafka_credential.default will be created
  + resource "upstash_kafka_credential" "default" {
      + cluster_id      = (sensitive value)
      + creation_time   = (known after apply)
      + credential_id   = (known after apply)
      + credential_name = "customer_processor_producer"
      + id              = (known after apply)
      + password        = (sensitive value)
      + permissions     = "PRODUCE"
      + state           = (known after apply)
      + topic           = "customer.v1.event"
      + username        = (known after apply)
    }

Plan: 7 to add, 1 to change, 3 to destroy.

Changes to Outputs:
  ~ database_user_connection_string = (sensitive value)

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*